src/cf/InformationRegisters/StatisticsAreas.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>StatisticsAreas</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>AreaID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DescriptionHash</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ShouldCollectStatistics</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/StatisticsAreas/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//  
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

Function GetRef(Description, ShouldCollectStatistics = False) Export
	DescriptionHash = DescriptionHash(Description);
	
	Ref = FindByHash(DescriptionHash);
	If Ref = Undefined Then
		Ref = CreateNew(Description, DescriptionHash, ShouldCollectStatistics);
	EndIf;
		
	Return Ref;
EndFunction

Function ShouldCollectStatistics(Description) Export
	DescriptionHash = DescriptionHash(Description);
	
	Query = New Query;
	Query.Text = "
	|SELECT
	|	StatisticsAreas.ShouldCollectStatistics
	|FROM
	|	InformationRegister.StatisticsAreas AS StatisticsAreas
	|WHERE
	|	StatisticsAreas.DescriptionHash = &DescriptionHash
	|";
	Query.SetParameter("DescriptionHash", DescriptionHash);
	
	Result = Query.Execute();
	If Result.IsEmpty() Then
		ShouldCollectStatistics = False;
	Else
		Selection = Result.Select();
		Selection.Next();
		
		ShouldCollectStatistics = Selection.ShouldCollectStatistics;
	EndIf;
	
	Return ShouldCollectStatistics
EndFunction

Function DescriptionHash(Description)
	DataHashing = New DataHashing(HashFunction.SHA1);
	DataHashing.Append(Description);
	DescriptionHash = StrReplace(String(DataHashing.HashSum), " ", "");
	
	Return DescriptionHash;
EndFunction

Function FindByHash(Hash)
	Query = New Query;
	Query.Text = "
	|SELECT
	|	StatisticsAreas.AreaID
	|FROM
	|	InformationRegister.StatisticsAreas AS StatisticsAreas
	|WHERE
	|	StatisticsAreas.DescriptionHash = &DescriptionHash
	|";
	Query.SetParameter("DescriptionHash", Hash);
	
	Result = Query.Execute();
	If Result.IsEmpty() Then
		Ref = Undefined;
	Else
		Selection = Result.Select();
		Selection.Next();
		
		Ref = Selection.AreaID;
	EndIf;
	
	Return Ref;
EndFunction

Function CreateNew(Description, DescriptionHash, ShouldCollectStatistics)
	BeginTransaction();
	
	Try
		Block = New DataLock;
		
		LockItem = Block.Add("InformationRegister.StatisticsAreas");
		LockItem.SetValue("DescriptionHash", DescriptionHash);
				
		Block.Lock();
		
		Ref = FindByHash(DescriptionHash);
		
		If Ref = Undefined Then
			Ref = New UUID();
			
			RecordSet = CreateRecordSet();
			RecordSet.DataExchange.Load = True;
			NewRecord1 = RecordSet.Add();
			NewRecord1.DescriptionHash = DescriptionHash;
			NewRecord1.AreaID = Ref;
			NewRecord1.Description = Description;
			NewRecord1.ShouldCollectStatistics = ShouldCollectStatistics;
			RecordSet.Write(False);
		EndIf;
		
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;
	
	Return Ref;
EndFunction

#EndRegion

#EndIf
